'''' اللَّهُمَّ إِنِّي أَسْأَلُكَ مُوجِبَاتِ رَحْمَتِكَ 
        وَعَزَائِمَ مَغْفِرَتِكَ   
    وَالسَّلاَمَةَ مِنْ كُلِّ إِثْمٍ
    والغَنِيمَةَ مِنْ كُلِّ بِرٍّ
        والفَوْزَ بالجَنَّةِ،
     والنَّجاةَ مِنَ النَّارِ '''
     
n=int(input())
a=list(map(int,input().split()))
c1s,c_1s=0,0
res=0
for i in a:
    if i==-1 :
        c_1s+=1
        if c1s<c_1s:
            res+=1
            c_1s=0
            c1s=0
        else:
            c1s-=c_1s
            c_1s=0  
    else:
        c1s+=i
print(res)